---
type: ProjectLocation
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# ProjectLocation

`Autodesk.Revit.DB.ProjectLocation` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Create | 2018 | `public static ProjectLocation Create ( Document document , ElementId siteLocationId , string name )` |
| Method | Duplicate | — | `public ProjectLocation Duplicate ( string name )` |
| Method | GetProjectPosition | — | `public ProjectPosition GetProjectPosition ( XYZ point )` |
| Method | GetSiteLocation | — | `public SiteLocation GetSiteLocation ()` |
| Method | IsProjectLocationNameUnique | 2019 | `public static bool IsProjectLocationNameUnique ( Document document , string name , ElementId siteLocationId )` |
| Method | SetProjectPosition | — | `public void SetProjectPosition ( XYZ point , ProjectPosition position )` |
| Property | Parameter | — | `` |